In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## How many passengers are in the dataset?

In [4]:
df['PassengerId'].size

891

## How many passenger survived and how many didn't

In [13]:
df['Survived'].value_counts().reset_index().set_index(pd.Index(['Dead', 'Survived'])).drop('Survived', axis=1)

          count
Dead        549
Survived    342

## Proportion of passengers who survived

In [25]:
(df[df['Survived'] == 1]['Survived'].size / df['Survived'].size) * 100

38.38383838383838

## Average age of the passengers

In [26]:
df['Age'].mean()

29.69911764705882

## Average fare of the passengers

In [27]:
df['Fare'].mean()

32.204207968574636

## Percentage of passengers on each class

In [39]:
percentage = df['Pclass'].value_counts().reset_index().set_index('Pclass')
percentage['percentage'] = percentage['count'].apply(lambda x: (x / percentage['count'].sum()) * 100) 
percentage.sort_index()

        count  percentage
Pclass
1         216   24.242424
2         184   20.650954
3         491   55.106622

## Proportion of surviving passenger on each class

In [99]:
surviving_per_class = df[df['Survived'] == 1].groupby('Pclass')['Survived'].value_counts().reset_index().drop('Survived', axis=1)
surviving_per_class.rename(columns={'count': 'survivors_by_class'}, inplace=True)
surviving_per_class['total_in_class'] = surviving_per_class['Pclass'].apply(lambda x: df[df['Pclass'] == x]['Pclass'].size)
surviving_per_class['Proportion'] =  surviving_per_class.apply(lambda row: row['survivors_by_class'] / row['total_in_class'], axis=1)
surviving_per_class.set_index('Pclass', inplace=True)
surviving_per_class

        survivors_by_class  total_in_class  Proportion
Pclass
1                      136             216    0.629630
2                       87             184    0.472826
3                      119             491    0.242363

## Range of ages of the passengers

In [81]:
print(f'[{df["Age"].min()} - {df["Age"].max()}]')

[0.42 - 80.0]